{"pages":[{"title":"<i class='fab fa-d3 d3fa-color-blue'><\/i> Artikelgutscheine","text":"Weitere Informationen zum Modul Artikelgutscheine finden Sie in unserem Shop: https:\/\/www.oxidmodule.com\/OXID-eShop\/Module\/Artikelgutschein-fuer-Oxid-PE.html","tags":"","url":"index.html"},{"title":"Changelog","text":"4.0.2.2 (2021-03-21) Fixed Gutschein lässt sich nicht entfernen 4.0.2.1 (2020-10-23) Fixed Steuerbetrag wird mehrfach reduziert 4.0.2.0 (2020-08-07) Added installierbar in OXID 6.2 4.0.1.1 (2019-02-04) Einheitliche Schreibweise für d3articlevoucher geändert 4.0.1.0 (2018-11-29) Anpassung auf Installation via Composer (Metadata Version 2.0) Umstellung der Dokumentation 4.0.0.1 (2018-11-26) Typo im Sprachbaustein fehlerhafte Prüfung der Zeitsteuerung an den Rabatten Bug im Zusammenhang mit weiteren Gutscheinen 4.0.0.0 (2018-07-10) flow-Theme Unterstützung Migration auf Oxid eShop 6.0.0 Support für 4.10.x\/5.3.x eingestellt 3.1.0.3 (2018-12-10) Typo im Sprachbaustein Fehlerhafe Prüfung der Zeitsteuerung an den Rabatten keine Einlösung weiterer Gutscheine möglich 3.1.0.2 (2017-10-24) Im Fall von Abweichungen zwischen der Gutscheinkonfiguration und der Rabattkonfiguration konnte es passieren, dass Gutscheine zwar eingelöst werden konnten, jedoch leer durchliefen (also kein Abzug und keine Dreingabe). Die Konfiguration der Rabatte wird nun ebenfalls geprüft und ggf. eine Meldung im Frontend ausgegeben. 3.1.0.1 (2017-01-18) Artikelgutschein-Rabatte bei deaktiviertem ModCfg-Eintrag kostenlos für alle Kunden Sofern das Modul vom Connector den Status &quot;nicht aktiv&quot; gemeldet bekommt (Aktiv-Haken entfernt oder z.B. Lizenz abgelaufen), werden alle Artikelgutschein-Rabatte ohne Prüfung zur Verwendung weitergereicht. Alle Kunden bekommen damit die bisher gegen Gutscheincodes verfügbaren Artikel komplett kostenlos automatisch in den Warenkorb gelegt. Im Bugfix werden diese in dem Fall aus der Liste der verfügbaren Rabatte aussortiert. Der Fall ist jedoch weiterhin wichtig, wenn der Shopbetreiber das Modul in den Erweiterungen deaktiviert oder deinstalliert. Darauf können wir dann jedoch keinen Einfluss mehr nehmen. 3.1.0.0 (2017-01-16) unnötige Ladevorgänge beim Überarbeiten des Warenkorbs entfernt Modulresourcen werden nur geladen, wenn Modul auch aktiv ist Bugfix: Installation angepasst, um mögliche Endlosschleifen zu vermeiden 3.0.3.0 (2015-12-09) Bugfix: explizite Prüfung auf &quot;nur Artikelgutscheine im Warenkorb&quot; Bugfix: Korrektur der Mehrwertsteuerberechnung in Verbindung mit Artikelgutscheinen Support für Shopversionen 4.7.x \/ 5.0.x eingestellt 3.0.2.1 (2015-07-21) Kontrolle auf Gültigkeit, vor dem hinzugefügen zum Warenkorb Warenkorbaktualisierung und Meldung ausgeben, falls nach dem Anmelden eines Benutzers (im Login-Popup) ungültige Gutscheine vorhanden sind freigegeben bis PHP 5.6 3.0.2.0 (2014-12-09) Mit dieser Version können die Gutscheinartikel nun optional als &quot;nicht separat kaufbar&quot; markiert werden. Die Artikel sind weiterhin zu Informationszwecken aufrufbar, können jedoch (außer über den Weg der Artikelgutscheine) nicht in den Warenkorb gelegt werden. Diese Einstellung lässt sich im Adminbereich des Shops setzen. 3.0.1.1 (2014-11-12) Bugfix für: Gutscheinserienartikel wird dem Warenkorb hinzugefügt obwohl der Gutschein nicht gültig ist 3.0.1.0 (2014-11-12) mehrfache Verwendung von Artikelgutscheinen (sofern erlaubt) legt Artikel auch mehrfach in den Warenkorb 3.0.0.3 (2014-08-05) Mit dieser Version wurden fehlende Templates und Sprachdateien nachgetragen. 3.0.0.2 (2014-05-06) Update der Systemprüfung (d3precheck.php) 3.0.0.1 (2014-03-24) Anpassung der Sprachbausteine Tests auf Shopversion 4.8 \/ 5.1 3.0.0.0 (2013-08-28) Portierung auf 4.7 \/ 5.0 Integration der automatischen Installation Sprache Englisch hinzugefügt 2.1.1.0 (2012-10-10) Mit diesem neuen Patch ist das Modul &quot;Artikelgutschein&quot; nun für die Shopversionen 4.5.1 bis 4.6.4 verfügbar. 2.1.0.0 (2012-07-12) Mit diesem Update ist unser Modul Artikelgutschein jetzt auch für die Shopversionen PE 4.5.x verfügbar.","tags":"","url":"changelog\/Changelog.html"},{"title":"Installation \/ Update \/ Deinstallation","text":"Anforderungen Neuinstallation Update Deinstallation Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unter Hilfe und Support genannten Kontaktdaten Bescheid.","tags":"","url":"installation\/Installation.html"},{"title":"Systemanforderungen","text":"PHP Version 5.6.x bis 7.4.x PHP Decoder installierter ionCube Loader Shopversionen \/ -editionen OXID eShop Community Edition (CE), Professional Edition (PE) oder Enterprise Edition (EE) in Compilation Version 6.0.x 6.1.x 6.2.x Themes Wave Flow Azure D3 Modul-Connector (kostenfrei bei D3 erhältlich) ab Version 5.3.0.0 Installation via Composer mindestens ein freier Cronjob zur automatischen Ausführung der angelegten Aufgaben Beachten Sie, dass die Ihnen vorliegende Modulversion entsprechend für PHP 5.6, PHP 7.0, PHP 7.1, PHP 7.2, PHP 7.3 oder PHP 7.4 sowie dem auf Ihrem Server vorhandenen Decoder (ionCube Loader) kompatibel ist. Im Zweifelsfall kontaktieren Sie uns und nennen den für Ihren Shop genutzten Decoder und die PHP-Version. Kontrollieren Sie bitte auch, ob diese Modulversion für die von Ihnen eingesetzte Shopedition (Professional Edition (PE) oder Enterprise Edition (EE)) ausgelegt ist.","tags":"","url":"installation\/Anforderungen\/Systemanforderungen.html"},{"title":"Vorbereitungen","text":"Installieren Sie bitte zuerst unseren Modul-Connector in der erforderlichen Version. Ob dies evtl. schon geschehen ist, können Sie im Adminbereich Ihres Shops prüfen. Existiert der Punkt Module -&gt; Modul-Connector, können Sie die installierte Version unter Bibliotheksverwaltung ablesen. Fehlt dieser Eintrag, installieren Sie den kostenfreien Connector. Informationen zu dessen Installation finden Sie auf unserer Homepage. Klicken Sie auf den Reiter Downloads und wählen dort das für Ihre Installation passende Paket.","tags":"","url":"installation\/Anforderungen\/Vorbereitungen.html"},{"title":"Neuinstallation","text":"Schnellstart per Composer php composer require d3\/articlevoucher:^4.0.2.2 --update-no-dev Detailliertere Angaben zur Installation entnehmen Sie bitte den folgenden Seiten.","tags":"","url":"installation\/Neuinstallation\/index.html"},{"title":"Vorbereitungen","text":"Installieren Sie bitte zuerst unseren Modul-Connector in der erforderlichen Version. Ob dies evtl. schon geschehen ist, können Sie im Adminbereich Ihres Shops prüfen. Existiert der Punkt Module -&gt; Modul-Connector, können Sie die installierte Version unter Bibliotheksverwaltung ablesen. Fehlt dieser Eintrag, installieren Sie den Modul-Connector bitte vorab. Hinweise zu dessen Installation finden Sie in der Modul-Connector Dokumentation.","tags":"","url":"installation\/Neuinstallation\/Vorbereitung.html"},{"title":"Modul zur Installation hinzufügen","text":"Führen Sie in der Konsole im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) diesen Befehl aus, um das Modul Artikelgutscheine zur Installation hinzuzufügen: php composer require d3\/articlevoucher:^4.0.2.2 --update-no-dev Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Neuinstallation\/Modul_hinzufuegen.html"},{"title":"Verwendung eigener Themes","text":"Das Modul ist für die Verwendung mit den folgenden OXID-Themes vorbereitet: Flow Azure Admin Verwenden Sie in Ihrem Shop ein angepasstes Verzeichnis für Ihre Templates (neues Theme oder CustomTheme), kopieren Sie die Templates und \/ oder die CSS-Dateien in die neuen Ordner. Ähnelt Ihr neues Theme technisch einem der OXID-Originale, können Sie dieses darauf umleiten. Childs von originalen OXID- Themes benötigen keine Umleitung. Weitere Informationen zur Umleitung finden Sie in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Verwendung_eigener_Themes.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Treffen Sie bei der Installation auf spezielle Anforderungen, zu denen Sie Unterstützung benötigen, kontaktieren Sie uns bitte für weiteren Support.","tags":"","url":"installation\/Neuinstallation\/Providerspezifische_Installation.html"},{"title":"Modul im Shop aktivieren","text":"Aktivieren Sie das Modul über den Shopadmin unter Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Artikelgutscheine auf den Button Aktivieren. Enterprise Editon: Achten Sie darauf, dass das Modul in weiteren Shops (Mall) ebenfalls aktiviert werden muss, um dessen Funktion dort auch zu nutzen.","tags":"","url":"installation\/Neuinstallation\/Modul_im_Shop_aktivieren.html"},{"title":"Shopanpassungen installieren","text":"Direkt nach der Modulaktivierung startet der Assistent, der Sie durch die Shopanpassung führt. Darin können Sie verschiedene Optionen der Installation wählen. Den Installationsassistenten finden Sie auch unter den Menüpunkten Admin -&gt; Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation. Bei tiefgreifenden Änderungen an Ihrem Shop (z.B. Hinzufügen weiterer Sprachen oder Mandanten) rufen Sie den Installationsassistenten bitte erneut auf, um dann eventuell notwendige Nacharbeiten für das Modul ausführen zu lassen. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen.","tags":"","url":"installation\/Neuinstallation\/Shopanpassungen_installieren.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Neuinstallation\/TMP-Ordner_leeren.html"},{"title":"Lizenzschlüssel eintragen","text":"Das Modul verwendet Lizenzschlüssel, um die Lizenzverwaltung für Sie und auch für uns einfacher zu gestalten. Hierbei haben Sie je nach Modul die Wahl zwischen einer kostenfreien Testlizenz und einer Lizenz für den Einsatz im Livebetrieb. Rufen Sie zum Anfordern des Lizenzschlüssels die Modulverwaltung im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung auf. Klappen Sie den Eintrag des jeweiligen Moduls aus. Sofern erforderlich, können Sie hier den Lizenzassistenten starten, der schnell und einfach ihr Modul aktiviert.","tags":"","url":"installation\/Neuinstallation\/Lizenz_eintragen.html"},{"title":"Konfiguration einstellen","text":"Backend Bestellstatus der Gutscheinartikel anpassen: Erweiterungen -&gt; Module -&gt; Artikelgutscheine -&gt; Tab: Einstell. -&gt; Option: Bestellstatus der Gutscheinartikel Führen Sie die weitere Konfiguration wie beschrieben im Handbuch durch: manual\/Konfiguration.html","tags":"","url":"installation\/Neuinstallation\/Konfiguration_einstellen.html"},{"title":"Updatefähigkeit","text":"Bei individuellen Änderungen von Moduldateien empfehlen wir, jeweils die Überladungsmöglichkeiten des Shops dafür zu verwenden. So brauchen Sie die originalen Moduldateien nicht verändern und erhalten sich so die Updatefähigkeit des Shops und des Moduls. Beachten Sie, dass Moduldateien bei Updateinstallationen überschrieben werden. Weitere Informationen zu den Überladungsmöglichkeiten verschiedener Dateien finden Sie in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Updatefaehigkeit.html"},{"title":"Wann kann ein Update ausgeführt werden?","text":"Die Updatenaweisungen können verwendet werden, wenn dieses Modul schon früher mit Hilfe von Composer installiert wurde. Wurde die Installation bisher noch nicht durchgeführt oder die Installation wurde nicht über Composer durchgeführt (weil das Modul dies z.B. früher nicht unterstützte), verwenden Sie bitte die Beschreibung unter Neuinstallation.","tags":"","url":"installation\/Update\/Updatedefinition.html"},{"title":"Modul deaktivieren","text":"Deaktivieren Sie das Modul über den Shopadmin unter Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Artikelgutscheine auf den Button Deaktivieren.","tags":"","url":"installation\/Update\/Modul_deaktivieren.html"},{"title":"Dateien erneuern","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie dort diesen Befehl aus: php composer require d3\/articlevoucher:^4.0.2.2 --update-no-dev Im weiteren Ablauf werden Sie gefragt, ob die Moduldateien überschrieben werden sollen. Bestätigen Sie dies für den Eintrag d3\/articlevoucher. Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Update\/Dateien_erneuern.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Treffen Sie bei der Installation auf spezielle Anforderungen, zu denen Sie Unterstützung benötigen, kontaktieren Sie uns bitte für weiteren Support.","tags":"","url":"installation\/Update\/Providerspezifische_Installation.html"},{"title":"Modulinformationen aktualisieren","text":"Wechseln Sie im Adminbereich zu Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Artikelgutscheine auf den Button Aktivieren.","tags":"","url":"installation\/Update\/Modulinformationen_aktualisieren.html"},{"title":"Shopanpassungen installieren","text":"Ob Shopanpassungen notwendig sind, ist von der Versionsänderung des Moduls abhängig. Möglicherweise sehen Sie nach dem Neuaktivieren des Moduls den Installationsassistent, der Sie durch die Änderungen führt. Folgen Sie dann den einzelnen Schritten. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen. Wird der Assistent nicht gezeigt (Sie sehen wieder die Modulübersicht), waren keine Anpassungen am Shop notwendig. Ob erforderliche Updates ausgeführt werden sollen, können Sie jederzeit im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation prüfen.","tags":"","url":"installation\/Update\/Shopanpassungen_installieren.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Update\/TMP-Ordner_leeren.html"},{"title":"Lizenzschlüssel aktualisieren","text":"Wird für die neue Modulversion ein aktualisierter Lizenzschlüssel benötigt, tragen Sie diesen im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung ein. Klappen Sie dazu den Eintrag des jeweiligen Moduls aus und starten den Lizenzassistent.","tags":"","url":"installation\/Update\/Lizenzschluessel_aktualisieren.html"},{"title":"Erweiterungen anpassen","text":"Haben Sie für dieses Modul eigene Erweiterung entwickelt, gleichen Sie dies bitte mit der neuen Fassung des Moduls ab.","tags":"","url":"installation\/Update\/Erweiterungen_anpassen.html"},{"title":"Installationsprüfung","text":"Um die erfolgreiche Installation zu prüfen, können Sie die folgende(n) Checkliste(n) verwenden: Backend Modul ist unter Erweiterungen -&gt; Module aktiv geschaltet Modul ist unter D3 Module -&gt; Modul-Connector -&gt; Modulverwaltung aktiv geschaltet Frontend Prüfung auf die Konfiguration: Modul kurzzeitig deaktivieren: im Anschluß sollte im Warenkorb der Dreingabeartikel erscheinen. Wird das Modul darauf hin wieder aktiviert, dann sollte der Dreingabeartikel wieder ausgeblendet werden.","tags":"","url":"installation\/Installationspruefung.html"},{"title":"Schnellstart","text":"Das Modul Artikelgutscheine bringt einen umfangreichen Adminbereich mit, in dem Sie die Konfigurationseinstellungen des Moduls setzen können. Über das Menü Module -&gt; Artikelgutscheine -&gt; Einstellungen erreichen Sie die Einstellseiten. Arbeiten Sie idealerweise die Optionen einmal durch. Hinweise zu den einzelnen Einstellungen finden Sie in dem dahinter stehenden Fragezeichenfeld. Durch einen Klick darauf öffnet sich der Hinweistext. Die meisten Optionen sind zusätzlich im Handbuch zum Modul umfangreicher beschrieben.","tags":"","url":"installation\/Schnellstart.html"},{"title":"Modulerweiterungen deaktivieren und entfernen","text":"Deaktivieren Sie alle vorhandenen Erweiterungen, die auf dem Modul Artikelgutscheine aufbauen und löschen bitte alle Dateien dieser Erweiterungen. Entfernen Sie ebenfalls alle individuellen Templateanpassungen für dieses Modul.","tags":"","url":"installation\/Deinstallation\/Modulerweiterungen_deaktivieren_und_entfernen.html"},{"title":"Modul deaktivieren","text":"Deaktivieren Sie das Modul Artikelgutscheine über den Shopadmin Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Artikelgutscheine auf den Button Deaktivieren.","tags":"","url":"installation\/Deinstallation\/Modul_deaktivieren.html"},{"title":"Modul aus der Installation entfernen","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie Sie dort diesen Befehl aus: php composer remove d3\/articlevoucher --no-update Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Deinstallation\/Modul_aus_der_Installation_entfernen.html"},{"title":"Dateien löschen","text":"Löschen Sie den Ordner articlevoucher und seine enthaltenen Elemente aus dem Verzeichnis source\/modules\/d3 Ihres Shops. Bestätigen Sie anschließend im Shopadmin unter Erweiterungen -&gt; Module -&gt; Installierte Shop-Module die Nachricht: Es gibt registrierte Erweiterungen im eShop, deren Verzeichnis nicht vorhanden ist. Möchten Sie alle Modulinformationen einschließlich Konfigurationseinstellungen und Blockinformationen für Templates löschen?","tags":"","url":"installation\/Deinstallation\/Dateien_loeschen.html"},{"title":"Datenbank bereinigen","text":"Das Modul legt Informationen in der Datenbank ab. Sofern diese Daten nicht mehr benötigt werden, können diese gelöscht werden. Legen Sie sich vorab bitte unbedingt eine Sicherung an, um die Daten im Zweifelsfall wiederherstellen zu können. Für das Modul Artikelgutscheine sind dies die folgende Tabellen und Felder: in Tabelle oxvoucherseries: das Feld D3DISCOUNTID Änderungen der Felddefinition: in Tabelle oxvoucherseries: das Feld OXDISCOUNTTYPE von ENUM('percent','absolute','discount') zu ENUM('percent','absolute') - discount wurde durch das Modul hinzugefügt' sowie diese Einträge in bestehenden Tabellen: in Tabelle d3_cfg_mod: den Eintrag oxmodid = &quot;d3articlevoucher&quot; **) **) Diesen Eintrag gibt es ggf. für jeden Subshop. Entfernen Sie diesen nur für die Mandanten, in denen das Modul nicht mehr installiert ist.","tags":"","url":"installation\/Deinstallation\/Datenbank_bereinigen.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Deinstallation\/TMP-Ordner_leeren.html"},{"title":"Benutzerhandbuch","text":"Ausgabe Gutscheinnummer und Einbindung Artikel bei korrekter Konfiguration","tags":"","url":"manual\/Handbuch.html"},{"title":"Konfiguration Rabatt","text":"Ablauf Rabatt anlegen Die Verkaufsmenge \/ Verkaufspreis min\/max festlegen In der Auswahlliste zur Option Rabatt den Eintrag 'item' auswählen über den nun angezeigten Button 'Artikel auswählen' den Gutscheinartikel auswählen. Der gewählte Artikel sollte Aktiv sein und bei genutzter Lagerverwaltung entsprechenden Lagerbestand haben. Eventuelle Einstellungen in den anderen Feldern\/Tabs sollten erst angepasst werden wenn die Funktionalität des Moduls und der Konfiguration sicher gestellt ist.","tags":"","url":"manual\/Konfiguration\/Rabatt.html"},{"title":"Konfiguration Gutscheinserie","text":"Ablauf Neue Gutscheinserie anlegen Anpassen der Einstellungen wie Gültigskeitszeitraum, Gültig ab Einkaufswert, Gültig mit gleicher Serie etc setzen. Für den ersten Test dürfen diese Einstellungen auch gern etwas weniger eingeschränkt sein. In der Auswahlliste zur Option Rabatt den Eintrag 'Artikel' auswählen. Darauf hin erscheint eine weiteres Dropdownfeld\/Auswahlliste. Selektieren Sie darin den erstellten Rabatt mit dem Artikel. Generieren der Gutscheine.","tags":"","url":"manual\/Konfiguration\/Gutscheinscheinserie.html"},{"title":"Hilfe und Support","text":"Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unten genannten Kontaktdaten Bescheid. Haben Sie Fragen oder Unklarheiten in Verbindung mit diesem Modul oder dessen Installation, stehen Ihnen Hilfetexte in unserem HelpCenter zur Verfügung. Finden Sie darin die benötigten Antworten nicht, kontaktieren Sie uns bitte unter den folgenden Möglichkeiten: per E-Mail: support@shopmodule.com oder über das Kontaktformular auf Oxidmodule.com oder per Telefon: (+49) 37 21 \/ 26 80 90 zu unseren Bürozeiten Geben Sie bitte an, wo und wie wir gegebenenfalls vorhandene Schwierigkeiten nachvollziehen können. Sind Ihre Fragen shopspezifisch, benötigen wir möglicherweise Zugangsdaten zum betreffenden Shop. Wir wünschen Ihnen mit Ihrem Shop und dem Modul viel Erfolg! Ihr D³-Team.","tags":"","url":"support\/Hilfe-und-Support.html"}]}